[{"title":null,"type":"rich","description":"**Правила Discord: ** <https://discord.com/guidelines>\n**Правила Сервера**\n(Тут содержаться лишь информация о том, что нельзя делать на сервере, если возникли вопросы к функционалу или структуризации каналов, то вам в <#875423348543352922>)\n\n**На сервере запрещено следующее:**\n\n**1. Оскорбления и неадекватное поведение:** \n\n**1.1. Участие в спорах:** Участник проекта не должен принимать участие в агрессивных публичных спорах. Разрешено вести споры в формате дискуссий. Спор считается агрессивным, если любой из участников переходит на личности. Если это происходит, то администратор и модератор могут потребовать закрыть спор или перенести его в другое место.  \n\nЗа провокации на конфликты и споры на участников будет наложен мут, со сроком 30 минут \n\nЗа агрессивный конфликт на участников конфликта будет наложен мут. В особых случаях если это сильно задело пользователя предупреждение со сроком по решению администратора или модератора. \n\n**1.2. Унижения и провокация:** Участник проекта должен относиться к другим участникам проекта с уважением. Не оскорблять их публично и не провоцировать других участников на нарушение правил. Любые высказывания, которые дискриминируют ту или иную группу лиц на сервере запрещены. Распространение чужих переписок с целью унижения на публику также запрещены. Оскорбления людей за пределами сервера также наказываются. Прямые оскорбления в шутках или пародирование гомофоба, сексиста, фуррихейтера, зоофила, нациста, некрофила или педофила также не приветствуется в чате, так как это может приводить к недопониманию со стороны других участников и перетекать в срачи. Нарушение ведёт к предупреждению со сроком на месяц Злоупотребление матами и CAPS LOCK'oм. Применять можно изредка и к месту, но чрезмерная брань запрещена. Придерживайтесь правил общепринятого этикета.  \n\nВ случае нарушения перечисленных примеров могут применяться следующие наказания: \n\nЗа любой вид оскорбления или неадекватное поведение в сторону другого участника мут, на размышление о поведении. В особых случаях если это сильно задело пользователя предупреждение со сроком по решению администратора или модератора. \n\nТоксичное поведение по отношению к другому пользователю, троллинг, буллинг или другие насмешки будет наказание в виде мута или бана, в зависимости от того что произошло \n\n**1.3. Никнейм участников** Псевдоним участника не должен нарушать условия обслуживания дискорда и его правила, повторять никнеймы других участников проекта, содержать оскорбительные слова в чей-то адрес. Так же никнейм участника сервера должен нормально упоминаться при его вводе. В случае нарушения этого правила администрация имеет право принудительно сменить никнейм и временно запретить участнику его менять.  \n\n**1.4 Пропаганда/проявление фашизма, экстремизма или дискриминации/нетерпимости** к группе по любому признаку, в том числе отправка картинок, видео, GIF- контент содержащие символику или проявляющие фашизма, экстремизма или дискриминации групп по любому признаку, на пользователя будет накладываться предупреждение без срока. За повторные нарушения будет наложен перманентный бан, без возможности его обжалования \n\n**1.5 За участие или причастность к рейду**, в том числе подозрения на рейд, участник получает бан, без возможности его обжалования. \n\n**1.6 За спам, флуд, мультипостинг** и прочие непотребства в чате на участников будет наложен мут.","url":null,"timestamp":null,"color":4286945,"fields":[],"thumbnail":null,"image":null,"author":null,"footer":null}][{"title":null,"type":"rich","description":"**2. Реклама своих проектов и ссылка на другие проекты  **\n\n**2.1. Ссылки-приглашения в публичных каналах**: Приглашения на сторонние проекты запрещены, если они не согласованы с администрацией. Если вы хотите рекламировать свой сервер у нас, то он должен удовлетворять нашим условиям. Основным условиям является то, что такие сервера не должны в себе содержать идею оскорбления тех или иных лиц, нарушать **ToS или правила Дискорда**. Для рекламы обращайтесь к администрации проекта! Любые приглашения без ведома администрации будут удаляться.  \n\n**2.2. Спам ссылками в приватных чатах**: Спам ссылками в приватных чатах полностью запрещен и наказуем. Участник отправляющий такой спам будет временно ограничен в отправке сообщений на сервер, а также помещен в отдельный канал. Если участник продолжит рекламировать после предупреждения, то будет изгнан из проекта на месяц.  \n\n**2.3. Ссылки и приглашения в профиле**: Полностью разрешены, за исключением ссылок на вредоносные ресурсы. Следует уточнить, что администрация ни в коем случае не запрещает участникам делиться ссылками на их сервера в своих личных сообщениях, а наказывает тех, кто этим злоупотребляет и рассылает рекламу на свой сервер другому участнику, хотя тот этого не хотел и не просил. Мы не преследуем цели душить других владельцев серверов и контентмейкеров, а пытаемся создать комфортную площадку для многих участников проекта. \n\n**За рекламу контентом который относиться к числу вредоносных, на участника будет наложен бан. **\n\n**3. NSFW/ASFW: ** \n\n**NSFW (Not Safe For Work) **- любой шокирующий контент, который не подходит для просмотра на работе. Сюда входят фетиши, кровь, обнаженная натура, гуро, обсценная лексика. \n\n**ASFW (Almost Safe For Work)** - любой шокирующий контент с цензурой, но по содержанию понятно, что это просто зацензуренный NSFW. Повесив цензуру на NSFW-контент, он не становится абсолютно БЕЗОПАСНЫМ для просмотра на работе или на публику.  \n\n**3.1. NSFW/ASFW-контент и NSFW ролеплей в публичных каналах**: В большинстве публичных каналов действует запрет на распространение NSFW-контента и ASFW-контента. NSFW-контент и ASFW-контент разрешено публиковать лишь в специально отведённых каналах, если вы хотите доступ к ним, то запросите доступ у администрации проекта. Любой NSFW и ASFW контент не в этих каналах наказуем, от предупреждения на 30 дней до лишения прав на публикацию картинок во всех каналах. При проведении NSFW ролеплеев или NSFW тем не в тех чатах, участник может быть временно ограничен в отправке сообщений в публичные каналы. \n\n**3.2 NSFW-контент и NSFW ролеплей в приватных чатах**: Отправка NSFW-контента в личках должна вестись лишь с разрешения данного участника проекта. Если вы нарушаете это правило неоднократно, то получаете предупреждение!  \n\n**4. Аватарки и профили участников Аватарки и профили участников** не должны нарушать ToS и правила платформы Discord, содержать оскорбления в сторону других участников или NSFW-контент. При нарушении данного правила от участника потребуют сменить аватар и ему временно ограничат доступ ко всем чатам, пока тот не сменит аватар. Если участник попадется несколько раз на этом, то получает бан на месяц! Если участник получает 3 предупреждения, то он изгоняется из сервера. Возможность разбана появляется не ранее, чем через месяц.","url":null,"timestamp":null,"color":4286945,"fields":[],"thumbnail":null,"image":null,"author":null,"footer":null}][{"title":null,"type":"rich","description":"**5. Отправка материала личного характера**, в том числе отправка скриншотов личной переписки. Отправка такого материала должна производиться с разрешения обоих сторон.  \n\nЗапрещается отправка информации или любых других материалов раскрывающие секреты человека, без разрешения этого человека. \n\nЗа нарушение подобных правил, человек получает бан без возможности его обжалования. Нужно быть добрее и не пытаться осквернить человека. \n\n**6. Правила поведения в голосовом канале такие же, как и в пункте 1**. Не стоит пытаться мешать людям разговаривать между собой. А если вы хотите что-то сказать, то пожалуйста подождите пока закончат между собой разговор участники. \n\n  \n\n**7. Администрация и модерация проекта оставляет за собой возможность совершить какое-либо действие в обход настоящих правил, если того требует ситуация. **\n\nПри этом может присутствовать возможность амнистии, если не было каких-либо сильных претензий. Амнистию можно запросить не ранее чем через 2 месяца с момента бана.  \n\nПосле амнистии человек попадает на испытательный срок, после его начала на участника выдаются 2 предупреждения на определённый срок, установленный советом администрации в зависимости от нарушения","url":null,"timestamp":null,"color":4286945,"fields":[],"thumbnail":null,"image":null,"author":null,"footer":null}]